OpenNuvoton/NUC970_NonOS_BSP/Driver/Include/uart.h
#define UART_LIN_CTL_LINS_DUM_EN_Pos    3                                          /*!< UART LIN_CTL: LINS_DUM_EN Position       */
#define UART_LIN_CTL_LINS_DUM_EN_Msk    (1ul << UART_LIN_CTL_LINS_DUM_EN_Pos)      /*!< UART LIN_CTL: LINS_DUM_EN Mask           */

#define UART_LIN_CTL_LINS_ARS_EN_Pos    2                                          /*!< UART LIN_CTL: LINS_ARS_EN Position       */
#define UART_LIN_CTL_LINS_ARS_EN_Msk    (1ul << UART_LIN_CTL_LINS_ARS_EN_Pos)      /*!< UART LIN_CTL: LINS_ARS_EN Mask           */

#define UART_LIN_CTL_LINS_HDET_EN_Pos   1                                          /*!< UART LIN_CTL: LINS_HDET_EN Position       */
#define UART_LIN_CTL_LINS_HDET_EN_Msk   (1ul << UART_LIN_CTL_LINS_HDET_EN_Pos)     /*!< UART LIN_CTL: LINS_HDET_EN Mask           */

#define UART_LIN_CTL_LINS_EN_Pos        0                                          /*!< UART LIN_CTL: LINS_EN Position       */
#define UART_LIN_CTL_LINS_EN_Msk        (1ul << UART_LIN_CTL_LINS_EN_Pos)          /*!< UART LIN_CTL: LINS_EN Mask           */

/* UART LIN_SR Bit Field Definitions */
#define UART_LIN_SR_BIT_ERR_F_Pos       9                                           /*!< UART LIN_SR: BIT_ERR_F Position       */
#define UART_LIN_SR_BIT_ERR_F_Msk       (1ul << UART_LIN_SR_LINS_SYNC_F_Pos)        /*!< UART LIN_SR: BIT_ERR_F Mask           */

#define UART_LIN_SR_LIN_BKDET_F_Pos     8                                           /*!< UART LIN_SR: LIN_BKDET_F Position       */
#define UART_LIN_SR_LIN_BKDET_F_Msk     (1ul << UART_LIN_SR_LINS_SYNC_F_Pos)        /*!< UART LIN_SR: LIN_BKDET_F Mask           */

#define UART_LIN_SR_LINS_SYNC_F_Pos     3                                           /*!< UART LIN_SR: LINS_SYNC_F Position       */
#define UART_LIN_SR_LINS_SYNC_F_Msk     (1ul << UART_LIN_SR_LINS_SYNC_F_Pos)        /*!< UART LIN_SR: LINS_SYNC_F Mask           */

#define UART_LIN_SR_LINS_IDPERR_F_Pos   2                                           /*!< UART LIN_SR: LINS_IDPERR_F Position       */
#define UART_LIN_SR_LINS_IDPERR_F_Msk   (1ul << UART_LIN_SR_LINS_IDPERR_F_Pos)      /*!< UART LIN_SR: LINS_IDPERR_F Mask           */

#define UART_LIN_SR_LINS_HERR_F_Pos     1                                           /*!< UART LIN_SR: LINS_HERR_F Position       */
#define UART_LIN_SR_LINS_HERR_F_Msk     (1ul << UART_LIN_SR_LINS_HERR_F_Pos)        /*!< UART LIN_SR: LINS_HERR_F Mask           */

#define UART_LIN_SR_LINS_HDET_F_Pos     0                                           /*!< UART LIN_SR: LINS_HDET_F Position       */
#define UART_LIN_SR_LINS_HDET_F_Msk     (1ul << UART_LIN_SR_LINS_HDET_F_Pos)        /*!< UART LIN_SR: LINS_HDET_F Mask           */

/* UART DEBUG Bit Field Definitions */
#define UART_DEBUG_ERR_DIVIA_F_Pos     	0                                           /*!< UART DEBUG: ERR_DIVIA_F Position       */
#define UART_DEBUG_ERR_DIVIA_F_Msk     	(1ul << UART_DEBUG_ERR_DIVIA_F_Pos)        	/*!< UART DEBUG: ERR_DIVIA_F Mask           */

#define UART_DEBUG_ERR_HETIME_OUT_F_Pos 1                                           /*!< UART DEBUG: ERR_HETIME_OUT_F Position  */
#define UART_DEBUG_ERR_HETIME_OUT_F_Msk (1ul << UART_DEBUG_ERR_HETIME_OUT_F_Pos)    /*!< UART DEBUG: ERR_HETIME_OUT_F Mask		*/

#define UART_DEBUG_ERR_HEFE_F_Pos     	2                                           /*!< UART DEBUG: ERR_HEFE_F Position       	*/
#define UART_DEBUG_ERR_HEFE_F_Msk     	(1ul << UART_DEBUG_ERR_HEFE_F_Pos)        	/*!< UART DEBUG: ERR_HEFE_F Mask           	*/

#define UART_DEBUG_ERR_SYNC_F_Pos     	3                                           /*!< UART DEBUG: ERR_SYNC_F Position       	*/
#define UART_DEBUG_ERR_SYNC_F_Msk     	(1ul << UART_DEBUG_ERR_SYNC_F_Pos)        	/*!< UART DEBUG: ERR_SYNC_F Mask           	*/

/* UART SC_CTL Bit Field Definitions */
#define UART_SC_CTL_RX_ERETRY_Pos     	0                                          	/*!< UART SC_CTL: RX_ERETRY Position       	*/
#define UART_SC_CTL_RX_ERETRY_Msk     	(7ul << UART_SC_CTL_RX_ERETRY_Pos)        	/*!< UART SC_CTL: RX_ERETRY Mask           	*/

#define UART_SC_CTL_RX_ERETRY_EN_Pos    3                                          	/*!< UART SC_CTL: RX_ERETRY_EN Position     */
#define UART_SC_CTL_RX_ERETRY_EN_Msk    (1ul << UART_SC_CTL_RX_ERETRY_EN_Pos)       /*!< UART SC_CTL: RX_ERETRY_EN Mask         */

#define UART_SC_CTL_TX_ERETRY_Pos     	4                                          	/*!< UART SC_CTL: TX_ERETRY Position       	*/
#define UART_SC_CTL_TX_ERETRY_Msk     	(7ul << UART_SC_CTL_TX_ERETRY_Pos)        	/*!< UART SC_CTL: TX_ERETRY Mask           	*/

#define UART_SC_CTL_TX_ERETRY_EN_Pos    7                                          	/*!< UART SC_CTL: TX_ERETRY_EN Position     */
#define UART_SC_CTL_TX_ERETRY_EN_Msk    (1ul << UART_SC_CTL_TX_ERETRY_EN_Pos)       /*!< UART SC_CTL: TX_ERETRY_EN Mask         */

/* UART SC_FSR Bit Field Definitions */
#define UART_SC_FSR_RX_OVER_ERETRY_Pos     	0                                       /*!< UART SC_FSR: RX_OVER_ERETRY Position  	*/
#define UART_SC_FSR_RX_OVER_ERETRY_Msk     	(1ul << UART_SC_FSR_RX_OVER_ERETRY_Pos) /*!< UART SC_FSR: RX_OVER_ERETRY Mask      	*/

#define UART_SC_FSR_TX_OVER_ERETRY_Pos     	1                                       /*!< UART SC_FSR: TX_OVER_ERETRY Position  	*/
#define UART_SC_FSR_TX_OVER_ERETRY_Msk     	(1ul << UART_SC_FSR_TX_OVER_ERETRY_Pos) /*!< UART SC_FSR: TX_OVER_ERETRY Mask      	*/

#define UART_SC_FSR_RX_ERETRY_F_Pos     	8                                       /*!< UART SC_FSR: RX_ERETRY_F Position  	*/
#define UART_SC_FSR_RX_ERETRY_F_Msk     	(1ul << UART_SC_FSR_RX_ERETRY_F_Pos) 	/*!< UART SC_FSR: RX_ERETRY_F Mask      	*/

#define UART_SC_FSR_TX_ERETRY_F_Pos     	9                                       /*!< UART SC_FSR: TX_ERETRY_F Position  	*/
#define UART_SC_FSR_TX_ERETRY_F_Msk     	(1ul << UART_SC_FSR_TX_ERETRY_F_Pos) 	/*!< UART SC_FSR: TX_ERETRY_F Mask      	*/

/*	Enable/Disable IrDA Mode */
#define ENABLEIrDA	          1  /*!< Enable IrDA */
#define DISABLEIrDA           0  /*!< Disable IrDA */

