OpenNuvoton/NUC970_NonOS_BSP/Driver/Include/uart.h
/*	define IrDA Direction */
#define IrDA_TX		          0   /*!< Set IrDA Tx direction*/
#define IrDA_RX		          1   /*!< Set IrDA Rx direction*/

/*	define RTS signal */
#define UART_RTS_HIGH			1  /*!< Set RTS high*/
#define UART_RTS_LOW			0  /*!< Set RTS low*/

/* define IOCTL command of UART operation mode, interrupt or pooling mode */
#define UART_IOC_SETTXMODE    	     	 1     /*!< Set Tx Mode */
#define UART_IOC_SETRXMODE    	     	 2     /*!< Set Tx Mode */
#define UART_IOC_GETRECCHARINFO      	 3     /*!< Get receive character */
#define UART_IOC_SETUARTPARAMETER    	 4     /*!< Config UART */
//#define UART_IOC_PERFORMBLUETOOTH	 	 5
#define UART_IOC_PERFORMIrDA         	 6     /*!< Config IrDA */
#define UART_IOC_GETUARTREGISTERVALUE    7     /*!< Get UART register value*/
#define UART_IOC_GETERRNO                8     /*!< Get rrror code */
//#define UART_IOC_SETMODEMLOOPBACK		 9
//#define UART_IOC_GETDSRSTATE			 10 
//#define UART_IOC_SETDTRSIGNAL			 11 
#define UART_IOC_SETINTERRUPT			 12    /*!< Set interrupt */
#define UART_IOC_SETBREAKCONTROL		 13    /*!< Set break */
#define UART_IOC_GETBIISTATE			 14    /*!< Get break status */
#define UART_IOC_GETCTSSTATE			 15    /*!< Get CTS status */
#define UART_IOC_SETRTSSIGNAL			 16    /*!< Set RTS signal */
#define UART_IOC_SETMODEMINTERRUPT		 17    /*!< Set modem interrupt */
#define UART_IOC_ENABLEHWFLOWCONTROL	 18    /*!< Enable H/W flow control */
#define UART_IOC_DISABLEHWFLOWCONTROL	 19    /*!< Disable H/W flow control */
//#define UART_IOC_ENABLESWFLOWCONTROL	 20    /*!< Enable S/W flow control */
//#define UART_IOC_DISABLESWFLOWCONTROL	 21    /*!< Disable S/W flow control */
//#define UART_IOC_SETUART1FULLMODEM       22  
//#define UART_IOC_SETUART1HIGHSPEED       23  

#define UART_IOC_FLUSH_TX_BUFFER         24    /*!< Flush Tx buffer */
#define UART_IOC_FLUSH_RX_BUFFER         25    /*!< Flus Rx buffer */

#define UART_IOC_SET_RS485_MODE        	 26     /*!< Select RS485 Mode */
#define UART_IOC_SEND_RS485_ADDRESS     27     /*!< Send RS485 Address*/
#define UART_IOC_SET_RS485_RXOFF       	 28     /*!< Select RS485 Mode */
#define UART_IOC_SET_ALTCTL_REG          29     /*!< Set ALT_CTL register */
#define UART_IOC_GET_ALTCTL_REG          30     /*!< Get ALT_CTL register */

#define UART_IOC_SET_LIN_MODE        	 31     /*!< Select LIN Mode */


/*	Enable/Disable Modem interrupt */
#define	UART_ENABLE_MODEM_INT	0   /*!< Enable Modem interrupt */
#define UART_DISABLE_MODEM_INT	1   /*!< Disable Modem interrupt */

/* These error code can get from UART_IOC_GETERRNO */  
#define UART_ERR_PARITY_INVALID          -1   /*!< Parity invalid */
#define UART_ERR_DATA_BITS_INVALID       -2   /*!< Data bits invalid */
#define UART_ERR_STOP_BITS_INVALID       -3   /*!< Stop bit invalid */
#define UART_ERR_TRIGGERLEVEL_INVALID    -4   /*!< Trigger level invalid */
#define UART_ERR_CHANNEL_INVALID         -5   /*!< UART channel invalid */
#define UART_ERR_ALLOC_MEMORY_FAIL       -6   /*!< Allocate memory error */
//#define UART_ERR_CLOCK_SOURCE_INVALID    -7   /*!< Clock Source invalid */
//#define UART_ERR_BAUDRATE_INVALID        -8   /*!< Baudrate invalid */
//#define UART_ERR_CONFIGURE_BT_FAIL       -9  
#define UART_ERR_IrDA_COMMAND_INVALID    -10   /*!< IrDA mode invalid */
#define UART_ERR_TX_BUF_NOT_ENOUGH       -11   /*!< Tx buffer not enough */
#define UART_ERR_OPERATE_MODE_INVALID    -12   /*!< Operation mode invalid */
#define UART_ERR_SET_BAUDRATE_FAIL       -13   /*!< Set baudrate fail */

/* These are the error code actually returns to user application */
#define UART_ERR_ID		0xFFFF1700	      /*!< UART library ID */
#define UART_ENOTTY	   (1 | UART_ERR_ID)  /*!< Command not support           */
#define UART_ENODEV    (2 | UART_ERR_ID)  /*!< Interface number out of range */
#define UART_EIO       (3 | UART_ERR_ID)  /*!< Read/Write error              */

/*@}*/ /* end of group NUC970_UART_EXPORTED_CONSTANTS */


/** @addtogroup NUC970_UART_EXPORTED_STRUCTS UART Exported Structs
  @{
*/

/// @cond HIDDEN_SYMBOLS
/*----------------------------------------------------*/
/* Define UART buffer structure                       */
/*----------------------------------------------------*/
typedef struct UART_BUFFER_STRUCT
{
	UINT32 volatile  uUartTxHead, uUartTxTail; 
	UINT32 volatile  uUartRxHead, uUartRxTail;  
	
	PUINT8    pucUartTxBuf;
	PUINT8    pucUartRxBuf;
	PVOID     pvUartVector;
	BOOL      bIsUseUARTTxInt;
	BOOL      bIsUseUARTRxInt;
    BOOL      bIsUARTInitial;
    
    PINT      pucUARTFlag;  
	PINT      pucLINFlag;
    INT32 volatile nErrno;  
    
}UART_BUFFER_T;
/// @endcond HIDDEN_SYMBOLS

/** \brief  Structure type of UART data
 */
typedef struct UART_STRUCT
{
    UINT32      uFreq;       /*!< UART clock frequency */
    UINT32		uBaudRate;   /*!< Baudrate */
    UINT8		ucUartNo;    /*!< UART Port */
    UINT8		ucDataBits;  /*!< Select Data length */
    UINT8		ucStopBits;  /*!< Select stop bit length */
    UINT8		ucParity;    /*!< Select Parity */
    UINT8		ucRxTriggerLevel;  /*!< Select Rx FIFO trigger level */
} UART_T;

/** \brief  Structure type of UART register
 */
typedef struct UART_REGISTER_STRUCT
{
	UINT32 uUartReg[14][2]; /*!< Store UART register value */
} UART_REGISTER_T;

/*@}*/ /* end of group NUC970_UART_EXPORTED_STRUCTS */


/** @addtogroup NUC970_UART_EXPORTED_FUNCTIONS UART Exported Functions
  @{
*/

/**
 *    @brief   Calculate UART baudrate mode0 divider
 *
 *    @param[in]   u32SrcFreq      UART clock frequency
 *    @param[in]   u32BaudRate     Baudrate of UART module
 *
 *    @return  UART baudrate mode0 divider
 *  \hideinitializer 
 *
 */
#define UART_BAUD_MODE0_DIVIDER(u32SrcFreq, u32BaudRate)    (((u32SrcFreq + (u32BaudRate*8)) / u32BaudRate >> 4)-2)

/**
 *    @brief   Calculate UART baudrate mode2 divider
 *
 *    @param[in]   u32SrcFreq     UART clock frequency
 *    @param[in]   u32BaudRate    Baudrate of UART module
 *
 *    @return  UART baudrate mode2 divider
 * \hideinitializer 
 */
#define UART_BAUD_MODE2_DIVIDER(u32SrcFreq, u32BaudRate)    (((u32SrcFreq + (u32BaudRate/2)) / u32BaudRate)-2)

/*-----------------------------------------*/
/* interface function declarations         */
/*-----------------------------------------*/
INT uartOpen(PVOID param);
INT uartInit(void);
INT uartIoctl(INT nNum, UINT32 uCom, UINT32 uArg0, UINT32 uArg1);
INT32 uartRelease(INT nNum);
INT32 uartWrite(INT nNum, PUINT8 pucBuf, UINT32 uLen);
INT32 uartRead(INT nNum, PUINT8 pucBuf, UINT32 uLen); 

/*@}*/ /* end of group NUC970_UART_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_UART_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */

#endif
